In [1]:
import pandas as pd

In [2]:
import numpy as np

# Part 1

`[protocol]://[user]:[password]@[host]/[database_name]`

get_db_url = 'mysql+pymysql://codeup:p@assw0rd@123.123.123.123/some_db'

'mysql+pymysql://codeup:p@assw0rd@123.123.123.123/some_db'

In [3]:
import env

In [5]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'

In [25]:
employees = pd.read_sql('select * from employees', url)
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [27]:
titles = pd.read_sql('select * from titles', url)
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [29]:
titles.shape

(443308, 4)

In [30]:
employees.shape

(300024, 6)

In [31]:
titles.describe(include = 'all')

               emp_no     title   from_date     to_date
count   443308.000000    443308      443308      443308
unique            NaN         7        6393        5888
top               NaN  Engineer  1998-10-25  9999-01-01
freq              NaN    115003         132      240124
mean    253075.034430       NaN         NaN         NaN
std     161853.292613       NaN         NaN         NaN
min      10001.000000       NaN         NaN         NaN
25%      84855.750000       NaN         NaN         NaN
50%     249847.500000       NaN         NaN         NaN
75%     424891.250000       NaN         NaN         NaN
max     499999.000000       NaN         NaN         NaN

In [13]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_no     5 non-null      int64
 1   title      5 non-null      object
 2   from_date  5 non-null      object
 3   to_date    5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

In [15]:
titles.dtypes

emp_no        int64
title        object
from_date    object
to_date      object
dtype: object

In [33]:
pd.read_sql('''
select distinct title
from employees.titles;
''', url)

                title
0     Senior Engineer
1               Staff
2            Engineer
3        Senior Staff
4  Assistant Engineer
5    Technique Leader
6             Manager

In [35]:
len(titles.title.unique())

7

In [36]:
titles.title.nunique()

7

In [37]:
pd.read_sql('''
SELECT min(to_date)
from employees.titles;
''', url)

  min(to_date)
0   1985-03-01

In [38]:
titles.to_date.min()

datetime.date(1985, 3, 1)

In [24]:
pd.read_sql('''
SELECT max(to_date)
from employees.titles;
''', url)

  max(to_date)
0   9999-01-01

In [39]:
titles.to_date.max()

datetime.date(9999, 1, 1)

# Part 2

# Part 3